191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
  /* ### Init_TPM init code */
  /* TPM2SC: TOF=0,TOIE=0,CPWMS=0,CLKSB=0,CLKSA=0,PS2=0,PS1=0,PS0=0 */
  TPM2SC = 0x00;                       /* Stop and reset counter */
  TPM2MOD = 0x05DCU;                   /* Period value setting */
  (void)(TPM2SC == 0);                 /* Overflow int. flag clearing (first part) */
  /* TPM1SC: TOF=0,TOIE=1,CPWMS=0,CLKSB=0,CLKSA=1,PS2=1,PS1=0,PS0=0 */
  TPM2SC = 0x4C;                       /* Int. flag clearing (2nd part) and timer control register setting */
  /* ### */
  
  PTFD  = 0b11111111;
  PTFDD = 0b11100000;
  PTDD  = 0b00011001;
  PTDDD = 0b00000100;
  PTCD  = 0b00101111;
  PTCDD = 0b00101101;
  PTBD  = 0b11111000;
  PTBDD = 0b01111000; 
  PTGD  = 0b00000011;
  PTGDD = 0b00000011;                          
   
  /* ### Init_ADC init code */
  /* APCTL2: ADPC11=0,ADPC10=0,ADPC9=0,ADPC8=0 */
  APCTL2 = 0x04;                                      
  /* ADCCFG: ADLPC=0,ADIV1=1,ADIV0=1,ADLSMP=0,MODE1=0,MODE0=0,ADICLK1=0,ADICLK0=0 */
  ADCCFG = 0x60;                                      
  /* ADCSC2: ADACT=0,ADTRG=0,ACFE=0,ACFGT=0 */
  ADCSC2 = 0x00;                                      
  /* ADCCV: ADCV11=0,ADCV10=0,ADCV9=0,ADCV8=0,ADCV7=0,ADCV6=0,ADCV5=0,ADCV4=0,ADCV3=0,ADCV2=0,ADCV1=0,ADCV0=0 */
  ADCCV =  0x00;                                      
  /* ADCSC1: COCO=0,AIEN=0,ADCO=0,ADCH4=1,ADCH3=1,ADCH2=1,ADCH1=1,ADCH0=1 */
  ADCSC1 = 0x0A;                                                                                     


  SCI1C2 = 0x00;                       /* Disable the SCI1 module */
  (void)(SCI1S1 == 0);                 /* Dummy read of the SCI1S1 registr to clear flags */
  (void)(SCI1D == 10);                 /* Dummy read of the SCI1D registr to clear flags */
  /* SCI1S2: LBKDIF=1,RXEDGIF=1,RXINV=0,RWUID=0,BRK13=0,LBKDE=0,RAF=0 */
  SCI1S2 = 0xC0;                                      
  /* SCI1BDH: LBKDIE=0,RXEDGIE=0,SBR12=0,SBR11=0,SBR10=0,SBR9=0,SBR8=0 */
  SCI1BDH = 0x00;                                      
  /* SCI1BDL: SBR7=1,SBR6=0,SBR5=0,SBR4=1,SBR3=1,SBR2=1,SBR1=0,SBR0=0 */
  SCI1BDL = 0x9C;                                      
  /* SCI1C1: LOOPS=0,SCISWAI=0,RSRC=0,M=0,WAKE=0,ILT=0,PE=0,PT=0 */
  SCI1C1 = 0x00;                                      
  /* SCI1C3: R8=0,T8=0,TXDIR=1,TXINV=0,ORIE=0,NEIE=0,FEIE=0,PEIE=0 */
  SCI1C3 = 0x00;                                      
  /* SCI1C2: TIE=0,TCIE=0,RIE=1,ILIE=0,TE=1,RE=1,RWU=0,SBK=0 */
  SCI1C2 = 0x2c;  


  SCI2C2 = 0x00;                       /* Disable the SCI1 module */
  (void)(SCI2S1 == 0);                 /* Dummy read of the SCI1S1 registr to clear flags */
  (void)(SCI2D == 10);                 /* Dummy read of the SCI1D registr to clear flags */
  /* SCI1S2: LBKDIF=1,RXEDGIF=1,RXINV=0,RWUID=0,BRK13=0,LBKDE=0,RAF=0 */
  SCI2S2 = 0xC0;                                      
  /* SCI1BDH: LBKDIE=0,RXEDGIE=0,SBR12=0,SBR11=0,SBR10=0,SBR9=0,SBR8=0 */
  SCI2BDH = 0x00;                                      
  /* SCI1BDL: SBR7=1,SBR6=0,SBR5=0,SBR4=1,SBR3=1,SBR2=1,SBR1=0,SBR0=0 */
  SCI2BDL = 0x9C;                                      
  /* SCI1C1: LOOPS=0,SCISWAI=0,RSRC=0,M=0,WAKE=0,ILT=0,PE=0,PT=0 */
  SCI2C1 = 0x00;                                      
  /* SCI1C3: R8=0,T8=0,TXDIR=1,TXINV=0,ORIE=0,NEIE=0,FEIE=0,PEIE=0 */
  SCI2C3 = 0x00;                                      
  /* SCI1C2: TIE=0,TCIE=0,RIE=1,ILIE=0,TE=1,RE=1,RWU=0,SBK=0 */
  SCI2C2 = 0x2c;  


  
  /* ### */
} /*MCU_init*/
#endif
/****************************************************/
/***********************************************************
*Name         :  InitialUserRegister
*Function     :  Initial User's Register
*Input Value  :  None
*Output Value :  None
*Introduction :
***********************************************************/
void InitialUserRegister(void)
{
	F_StopResponse = 1;
	R_HomeNetResponseCheckTime = 10;
	u16_random = 0x00000001;
}
/**********************************************************/
void Time(void)
{

	if (f_2Ms_Flag) //2ms标志  //CFJ
	{
		f_2Ms_Flag = 0;
		/*
             if(g_Rec_Status_Flag)
             {
                 g_Bus_Rec_Time++;
                 if(g_Bus_Rec_Time>=250) //500ms
                 {
                    g_Bus_Rec_Time=0;
                    bUartSendStartFlag=1;
                    g_Txd_Time=0;
                    g_Rec_Status_Flag=0;
                    //Mfs_Uart_EnableFunc(&UART1, UartTx);    //使能发送接收
                    //Mfs_Uart_DisableFunc(&UART1, UartRx); //接受使能无效
                 }            
             }
             */
		if (g_Bus_Error_Time >= 30000) //转为接受状态，1min内未收到数据，则报故障
		{
			g_Sys_Erflag0_Comm = 1; //通讯错误 @20181025 CFJ
		}
		else
		{
			g_Bus_Error_Time++;
		}
	}

	if (f_05s)
	{
		if (!f_halfsec)
		{
			f_halfsec = 1;
			u8_Send_Print_Time++;
		}
		else
		{
			f_05s = 0;
			f_halfsec = 0;
		}
	}

	if (f_halfsec)
	{
		t_1min++;
		if (t_1min >= 120)
		{
			t_1min = 0;
			f_1min = 1;
		}
	}

	if (f_1min) //1min
	{
		if (!f_onemin)
		{
			f_onemin = 1;
		}
		else
		{
			f_1min = 0;
			f_onemin = 0;
		}
	}
	if (f_halfsec)
	{
		t_10s++;
		if (t_10s >= 20)
		{
			t_10s = 0;
			t_tens++;
			f_10s = 1;
		}
	}
	if (f_10s) //10s
	{
		if (!f_tens)
		{
			f_tens = 1;
		}
		else
		{
			f_10s = 0;
			f_tens = 0;
		}
	}
}
//********判断上电后蜂鸣器延迟报警程序**********
void PowerUpBuzzDelaylc(void)
{
	if (f_Powerupdelaylc)
	{
		return;
	}
	if (f_onemin)
	{
		u8_BuzzDlyMinlc++;
		if (u8_BuzzDlyMinlc >= 60)
		{
			u8_BuzzDlyMinlc = 0;
			u8_BuzzDlyHourlc++;
		}
	}

	if (u8_BuzzDlyHourlc >= u8_lc_bjycsj) //上电报警计时大于设定的延时时间
	{
		f_Powerupdelaylc = 1;
	}
}
//**********************************************/
void PowerUpBuzzDelayld(void)
{
	if (f_Powerupdelayld)
	{
		return;
	}
	if (f_onemin)
	{
		u8_BuzzDlyMinld++;
		if (u8_BuzzDlyMinld >= 60)
		{
			u8_BuzzDlyMinld = 0;
			u8_BuzzDlyHourld++;
		}
	}

	if (u8_BuzzDlyHourld >= u8_ld_bjycsj)
	{
		f_Powerupdelayld = 1;
	}
}
//**********************************************
//********************蜂鸣器程序****************
//**********************************************
void BuzzPrg(void)
{
	if (f_bi) //叫一声
	{
		if ((uchar)(t_onems - t_buzz) >= 200) //200ms
		{
			goto Tfmq;
		}
	}
	else if (f_bibibi) //连续叫,叫100ms,停50ms
	{
		if (r_buzz == 0)
		{
			if ((unsigned char)(t_onems - t_buzz) >= 100) //100ms
			{
				r_buzz = 1;
				t_buzz = t_onems;
				goto Tfmq;
			}
		}
		else if (r_buzz == 1)
		{
			if ((unsigned char)(t_onems - t_buzz) >= 50) //50ms
			{
				r_buzz = 2;
				t_buzz = t_onems;
				PWM_Start();
				//TPM1SC = 0x00;  @20181008 CFJ
				//TPM1MOD = 0x0176;   @20181008 CFJ
				//(void)(TPM1C3SC == 0);

				//TPM1C3SC = 0x28;          @20181008 CFJ
				//TPM1C3V = 0xBB;
				//(void)(TPM1SC == 0);
				//TPM1SC = 0x0C;
			}
		}
		else if (r_buzz == 2)
		{
			if ((unsigned char)(t_onems - t_buzz) >= 100) //100ms
			{
				r_buzz = 3;
				t_buzz = t_onems;
				goto Tfmq;
			}
		}
		else if (r_buzz == 3)
		{
			if ((unsigned char)(t_onems - t_buzz) >= 50) //50ms
			{
				r_buzz = 4;
				t_buzz = t_onems;
				PWM_Start();
				//TPM1SC = 0x00;       @20181008 CFJ
				//TPM1MOD = 0x0176;
				//(void)(TPM1C3SC == 0);     @20181008 CFJ

				//TPM1C3SC = 0x28;
				//TPM1C3V = 0xBB;
				//(void)(TPM1SC == 0);
				//TPM1SC = 0x0C;
			}
		}
		else if (r_buzz == 4)
		{
			if ((unsigned char)(t_onems - t_buzz) >= 100) //100ms
			{
				r_buzz = 0;
				goto Tfmq1;
			}
		}
		else
		{
			goto Tfmq1;
		}
	}
	else
	{
		goto Tfmq1;
	}
	return;
Tfmq1:
	f_bibibi = 0;
Tfmq:
	f_bi = 0;
	PWM_Stop();
	//TPM1SC = 0x00;    @20181008 CFJ
	//TPM1C3SC = 0x00;   @20181008 CFJ
}
//********************蜂鸣器响程序**************
//**********************************************
void BuzzBi(void)
{
	f_bi = 1;
	t_buzz = t_onems;
	PWM_Start();
	//TPM1SC = 0x00;                               /* Stop and reset counter */ @20181008 CFJ
	// TPM1MOD = 0x0176;                            /* Period value setting */  @20181008 CFJ
	//(void)(TPM1C3SC == 0);                       /* Channel 0 int. flag clearing (first part) */  @20181008 CFJ
	/* TPM1C3SC: CH3F=0,CH3IE=0,MS3B=1,MS3A=0,ELS3B=1,ELS3A=0 */		 //@20181008 CFJ
																		 //TPM1C3SC = 0x28;                             /* Int. flag clearing (2nd part) and channel 0 contr. register setting */  @20181008 CFJ
																		 // TPM1C3V = 0xBB;                              /* Compare 0 value setting */   @20181008 CFJ
																		 //(void)(TPM1SC == 0);                         /* Overflow int. flag clearing (first part) */  @20181008 CFJ
	/* TPM1SC: TOF=0,TOIE=0,CPWMS=0,CLKSB=0,CLKSA=1,PS2=1,PS1=0,PS0=0 */ //@20181008 CFJ
																		 // TPM1SC = 0x0C;                               /* Int. flag clearing (2nd part) and timer control register se*/  @20181008 CFJ
}
//^^^^^^^^^^^^^^^^
void BuzzBiBiBi(void)
{
	f_bibibi = 1;
	r_buzz = 0;
	t_buzz = t_onems;
	PWM_Start();
	//TPM1SC = 0x00;                 @20181008 CFJ
	//TPM1MOD = 0x0176;             @20181008 CFJ
	//(void)(TPM1C3SC == 0);         @20181008 CFJ

