191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
	// TPM1C3SC = 0x28;               @20181008 CFJ
	// TPM1C3V = 0xBB;               @20181008 CFJ
	//(void)(TPM1SC == 0);          @20181008 CFJ

	//TPM1SC = 0x0C;              @20181008 CFJ
}
/****************************************************/
/*********************AD转换程序*********************/
/****************************************************/
unsigned char SingleAd(unsigned char channel);
unsigned char CheckLcTable(unsigned char ad_8b);
float CheckLcTable_12b(unsigned int ad_12b);
/****************************************************/
void ad_convert(void)
{
	uchar adtemp;

	if ((unsigned char)(t_onems - t_ad) >= 200 || !f_first_ad)
	{
		t_ad = t_onems;
		adtemp = r_hwadtemp;
		r_hwadtemp = ADC_GetValue(22); //SingleAd(AD_CH10); @2018108 CFJ
		if (r_hwadtemp >= adtemp)
		{
			adtemp = r_hwadtemp - adtemp;
		}
		else
		{
			adtemp = adtemp - r_hwadtemp;
		}
		if (adtemp <= 5)
		{
			r_hwad = r_hwadtemp;
			r_hwsjwd = CheckLcTable(r_hwad);
		}
		else
		{
			return;
		}
	}
}
//^^^^^^^^^^^^^^^^^^
/*
unsigned char SingleAd(unsigned char channel)
{
	ADCSC1=channel;
	while(!ADCSC1_COCO)	
	{
		__NOP; //nop; @20181008 CFJ
		__NOP;//nop; @20181008 CFJ
	}
	return(ADCRL);	
}
*/
//^^^^^^^^^^^^^^^^^^
unsigned char CheckLcTable(unsigned char ad_8b)
{
	if (ad_8b > 223)
	{
		return (8);
	}
	else if (ad_8b <= 23)
	{
		return (98);
	}
	else
	{
		return (table_lc[(unsigned char)(ad_8b - 24)]);
	}
}

/**
 * @brief ad转换为温度
 *
 * 
 *
 * @param  Ad   12位ad
 * @retval 实际温度+38
 */
float CheckLcTable_12b(unsigned int Ad)
{
    unsigned int i = 0;
    float Temp;
    if ((float)Ad >= table_lc_12b[0][0])
    {
        return table_lc_12b[0][1] + 38; //-30度
    }
    else if ((float)Ad <= table_lc_12b[18][0])
    {
        return table_lc_12b[18][1] + 38; //60度
    }
    else
    {
        while ((float)Ad < table_lc_12b[i][0])
            i++;
        Temp = 38 + table_lc_12b[i - 1][1] + 5 * (Ad - table_lc_12b[i - 1][0]) / (table_lc_12b[i][0] - table_lc_12b[i - 1][0]); //浮点型温度
    }
    return Temp;
}
/****************************************************/
/********************显示处理************************/
/****************************************************/
void RuleForLdDisp(void);
void RuleForLcDisp(void);
void LdDisp(void);
void LcDisp(void);
void AlarmAndLockLed(void);
/**********************************************/
void DealDispData(void)
{
	RuleForLdDisp();

#if (LC_DISP_RESOLUTION_0D1 || LC_RESOLUTION_0D1) //显示分辨率0.1度
	RuleForLcDisp_0D1();						  //显示温度人工干预，不采用实际温度  (分辨率1度)
#else
	RuleForLcDisp(); //显示温度人工干预，不采用实际温度   (分辨率1度)
#endif

	LcDisp(); //把每个数码管显示内容确定下来
	LdDisp();
	AlarmAndLockLed();
}
/****************************************************/
/********************冷冻显示规则********************/
/****************************************************/
void RuleForLdDisp(void)
{
	if (!f_first_ad) //没有完成1次AD采样就返回
	{
		return;
	}
	if (!f_ld_first_disp)
	{
		f_ld_first_disp = 1;
		r_ldgzwd = r_ldsjwd;
		t_ld_rule = t_halfsec;
	}
	//实际温度>设定温度+1或者实际温度<设定温度
	else if ((r_ldsjwd > (unsigned char)(r_ldzt + 1)) || (r_ldsjwd < r_ldzt)) //30s变化一度
	{

		if ((t_halfsec - t_ld_rule) >= 120) //60s HW 20190810
		{
			t_ld_rule = t_halfsec;
			if (r_ldsjwd > r_ldgzwd)
			{
				r_ldgzwd++;
			}
			else if (r_ldsjwd < r_ldgzwd)
			{
				r_ldgzwd--;
			}
		}
	}
	else
	{
		if (r_ldgzwd != r_ldzt)
		{

			if ((t_halfsec - t_ld_rule) >= 120) //60s HW 20190810
			{
				t_ld_rule = t_halfsec;
				if (r_ldgzwd > r_ldzt)
				{
					r_ldgzwd--;
				}
				else if (r_ldgzwd < r_ldzt)
				{
					r_ldgzwd++;
				}
			}
		}
		
	}
	r_ldxswd = r_ldgzwd;

	if ((r_hwsjwd >= 67) && (r_ldzt <= 170)) //当环境温度大于29℃且设定温度小于-30℃
	{
		r_ldxswd = r_ldxswd - 2; //显示值-2
	}
	else if (r_ldzt <= 170)
	{
		r_ldxswd = r_ldxswd - 1; //显示值-1
	}

	/*if(r_ldwdjz>=10)//温度校正
  {
    r_ldxswd = r_ldgzwd+(r_ldwdjz-10);
  }
  else
  {
    r_ldxswd = r_ldgzwd-(10-r_ldwdjz);
  }*/
}



/****************************************************/
/********************冷藏显示规则（分辨率0.1度）********************/
/****************************************************/
void RuleForLcDisp_0D1(void)
{
	if (!f_first_ad) //还未采样温度
	{
		return;
	}
	if (!f_lc_first_disp) //首次显示
	{
		f_lc_first_disp = 1;
		r_lcgzwd_float = r_lcwd_float; //显示实际温度
		t_lc_rule = t_halfsec;		   //记下显示刷新时间点
		u8_LcRule = t_tens;
	}
	else   //渐变到实际温度
	{
        if ((t_halfsec - t_lc_rule) >= 12) //6秒
        {
            t_lc_rule = t_halfsec;

            if (fabs(r_lcwd_float - r_lcgzwd_float) < 0.1)
                r_lcgzwd_float = r_lcwd_float;
            else
            {
                if (r_lcwd_float > r_lcgzwd_float) //显示温度<实际温度
                {
                    r_lcgzwd_float += 0.1; //显示温度++
                }
                else if (r_lcwd_float < r_lcgzwd_float)
                {
                    r_lcgzwd_float -= 0.1;
                }
            }
        }
	}
	
	r_lcxswd_float = r_lcgzwd_float;
	r_lcgzwd = (unsigned char)floor(r_lcgzwd_float); //有些地方还需要用到r_lcgzwd,比如压缩机连续运行保护的功能需要判断r_lcgzwd是否等于设置温度，所以取r_lcgzwd_float得整数部分给r_lcgzwd
}

/****************************************************/
/********************冷冻显示处理********************/
/****************************************************/
void LdDisp(void)
{
	unsigned char r_bw, r_sw, r_gw;

	if (!f_first_ad)
	{
		return;
	}
    if(f_disp_Wifi_Cfg)
	{
		if(f_disp_Wifi_Cfg == 1)
		{
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_bw = 25;  //.
				r_sw = 25;	//.
				r_gw = 25;	//.
			}
			else
			{
				r_bw = DISP_NO;
				r_sw = DISP_NO;
				r_gw = DISP_NO;
			}
		}
		else if(f_disp_Wifi_Cfg == 2)
		{
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_bw = DISP_C;
				r_sw = DISP_F;
				r_gw = 9;
			}
			else
			{
				r_bw = DISP_NO;
				r_sw = DISP_NO;
				r_gw = DISP_NO;
			}
		}
	}
	else if (f_test_alarm || f_First_PowerOnFlag) //@20181120 CFJ
	{
		r_led11 = 0xff;
		r_led12 = 0xff;
		r_led13 = 0xff;
		return;
	}
	else if (r_set_state1 == SET_F0)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO; //不显示
			r_sw = DISP_F;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 0;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state1 == SET_F1)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_F;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 1;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L0)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 0;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
		else if (r_flash_bit == BIT2)
		{
			r_bw = DISP_NO;
			r_gw = 0;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_sw = DISP_L;
			}
			else
			{
				r_sw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L1)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 1;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L2)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 2;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L3)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 3;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L4)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 4;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD_L5)
	{
		if (r_flash_bit == BIT3)
		{
			r_bw = DISP_NO;
			r_sw = DISP_L;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = 5;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == SET_LD || r_set_state == SET_LD_HIGH || r_set_state == SET_LD_LOW)
	{
		if (r_flash_bit == BIT1)
		{
			if (f_zf == ZHENG_SIGN)
			{
				if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
				{
					r_bw = DISP_ZH;
				}
				else
				{
					r_bw = DISP_NO;
				}
			}
			else
			{
				if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
				{
					r_bw = DISP_FH;
				}
				else
				{
					r_bw = DISP_NO;
				}
			}
			r_sw = r_swtj;
			r_gw = r_gwtj;
		}
		else if (r_flash_bit == BIT2)
		{
			if (f_zf == ZHENG_SIGN)
			{
				r_bw = DISP_NO;
			}
			else
			{
				r_bw = DISP_FH;
			}
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_sw = r_swtj;
			}
			else
			{
				r_sw = DISP_NO;
			}
			r_gw = r_gwtj;
		}
		else if (r_flash_bit == BIT3)
		{
			if (f_zf == ZHENG_SIGN)
			{
				r_bw = DISP_NO;
			}
			else
			{
				r_bw = DISP_FH;
			}
			r_sw = r_swtj;
			if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
			{
				r_gw = r_gwtj;
			}
			else
			{
				r_gw = DISP_NO;
			}
		}
	}
	else if (r_set_state == LD_CHK_VOL) //显示测量的电压
	{
		if (r_voltage / 100 == 0)
		{
			r_bw = DISP_NO;
		}
		else
		{
			r_bw = r_voltage / 100;
		}
		r_sw = r_voltage % 100 / 10;
		r_gw = r_voltage % 10;
	}
	else if (r_set_state == LD_CHK_HW) //环温传感器
	{
		if (f_hw_sensor_err) //环温传感器故障显示E0
		{
			r_bw = DISP_NO;
			r_sw = DISP_E;
			r_gw = 0;
		}
		else if (r_hwsjwd < 38)
		{
			r_bw = DISP_FH;
			r_sw = (uchar)((38 - r_hwsjwd) / 10);
			r_gw = (uchar)((38 - r_hwsjwd) % 10);
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = (uchar)((r_hwsjwd - 38) / 10);
			r_gw = (uchar)((r_hwsjwd - 38) % 10);
		}
	}
	else if (r_set_state == SET_LD_WDJZ) //冷冻温度校准
	{
		if (r_ldwdjzx >= 10)
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
			r_gw = r_ldwdjzx - 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_FH;
			r_gw = 10 - r_ldwdjzx;
		}
	}
	else if (r_set_state == SET_LD_BJYCSJ) //冷冻压机延迟时间
	{
		r_bw = DISP_NO;
		if (u8_ld_bjycsjx >= 10)
		{
			r_sw = 1;
		}
		else
		{
			r_sw = DISP_NO;
		}
		r_gw = u8_ld_bjycsjx % 10;
	}
	else if (r_set_state == SET_LDYJ) //按键设置压机开停
	{
		r_bw = DISP_NO;
		r_sw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			if ((flag_ajszyjkt & 0x01) == 0x01)
				r_gw = 1;
			else
				r_gw = 0;
		}
		else
		{
			r_gw = DISP_NO;
		}
	}
	else if (r_set_state == SET_YEAR)
	{
		r_gw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			r_bw = u8_year / 10;
			r_sw = u8_year % 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
		}
	}
	else if (r_set_state == SET_MONTH)
	{
		r_gw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			r_bw = u8_month / 10;
			r_sw = u8_month % 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
		}
	}
	else if (r_set_state == SET_DAY)
	{
		r_gw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			r_bw = u8_day / 10;
			r_sw = u8_day % 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
		}
	}
	else if (r_set_state == SET_HOUR)
	{
		r_gw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			r_bw = u8_hour / 10;
			r_sw = u8_hour % 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
		}
	}
	else if (r_set_state == SET_MINUTE)
	{
		r_gw = DISP_NO;
		if (t_halfsec & 0x01) //0b00000001)  @20181008 CFJ
		{
			r_bw = u8_minute / 10;
			r_sw = u8_minute % 10;
		}
		else
		{
			r_bw = DISP_NO;
			r_sw = DISP_NO;
		}
	}
	else if (r_set_state == USB_Insert_Or_PullOut)
	{
		switch (u8_UsbState)
		{
		case 0:
			r_gw = DISP_b;
			r_sw = 5;
			r_bw = DISP_U;
			break;
		case 1:
			r_gw = DISP_Dot;
			r_sw = DISP_Dot;
			r_bw = DISP_Dot;
			break;
		case 2:
			r_gw = DISP_NO;
			r_sw = DISP_k;
			r_bw = DISP_o;
			break;
		default:
			break;
		}
	}
	else if (f_ld_DispErrs) //显示高温/低温/冷冻SNR故障
	{
		if (f_ld_high && f_ld_high_disp)
		{
			if ((t_halfsec - t_ld_err_disp) >= 6) //3s
			{
				t_ld_err_disp = t_halfsec;
				f_ld_high_disp = 0;
			}
			r_bw = DISP_NO;
			r_sw = DISP_E;
			r_gw = 9;
		}
		else if (f_ld_low && f_ld_low_disp)
		{
			if ((t_halfsec - t_ld_err_disp) >= 6) //3s
			{
				t_ld_err_disp = t_halfsec;
				f_ld_low_disp = 0;
			}
			r_bw = DISP_E;
			r_sw = 1;
			r_gw = 0;
		}
		else
		{
			f_ld_DispErrs = 0;
			return;
		}
	}
	else if (f_key_defrost && f_key_defrost_disp) //除霜时,显示3sDF,显示5秒温度
	{
		if ((t_halfsec - t_ld_err_disp) >= 6)
		{
			t_ld_err_disp = t_halfsec;
			f_key_defrost_disp = 0;
		}
		r_bw = DISP_NO;
		r_sw = DISP_D;
		r_gw = DISP_F;
	}
	else if (f_power_off && f_power_off_disp) //加
	{
		r_bw = DISP_NO;
		r_sw = DISP_NO;
		r_gw = DISP_NO;
	}
	else if (f_ld_sensor_err)
	{
		if ((t_halfsec - t_ld_err_disp) >= 10) //5s
		{
			f_key_defrost_disp = 1;
			t_ld_err_disp = t_halfsec;
		}
		r_bw = DISP_NO;
		r_sw = DISP_E;
		r_gw = 6;
	}
	else if (g_Sys_Erflag0_Comm) //@20181130 CFJ 增加通讯故障标志
	{
		r_bw = DISP_NO;
		r_sw = DISP_E;
		r_gw = 4;
	}
	else
	{
		if ((t_halfsec - t_ld_err_disp) >= 10) //5s
		{
			f_key_defrost_disp = 1;
			t_ld_err_disp = t_halfsec;
		}
		if (r_ldxswd >= 200)
		{
			r_bw = DISP_NO;
			r_sw = (uchar)((r_ldxswd - 200) / 10);
			r_gw = (uchar)((r_ldxswd - 200) % 10);
		}
		else
		{
			r_bw = DISP_FH; //-
			r_sw = (uchar)((200 - r_ldxswd) / 10);
			r_gw = (uchar)((200 - r_ldxswd) % 10);
		}
	}

	r_led11 = table_led[r_bw];
	r_led12 = table_led[r_sw];
	r_led13 = table_led[r_gw];
}
/****************************************************/
/********************冷藏显示处理********************/
/****************************************************/
void LcDisp(void) //把每个数码管显示内容确定下来
{
	unsigned char r_bw, r_sw, r_gw;

	flag_Now_Disp_LCWD = 0; //
    flag_Disp_LCWD_D = 0;

