191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
/****************************************************/
/*****************Judge Errs*************************/
/****************************************************/
void JudgeLdErr(void);
void JudgeLcErr(void);
void JudgeHwErr(void);
void JudgeHwHigh(void);
void JudgeLdHigh(void);
void JudgeLcHigh(void);
void JudgeLdLow(void);
void JudgeLcLow(void);
void JudgeVoltageErr(void);
void JudgePowerOff(void);
void JudgeBattery(void);
/*****************************************************/
void JudgeErrs(void)
{
	if (f_first_ad)
	{
		JudgeLdErr();
		JudgeLcErr(); //传感器故障
		JudgeHwErr();
		JudgeHwHigh();
		JudgeLdHigh();
		JudgeLdLow();
		JudgeLcHigh();
		JudgeLcLow();
		JudgePowerOff();
		JudgeBattery();
		JudgeVoltageErr();
	}
	// f_ld_sensor_err =1;
	// f_lc_sensor_err =1;
	// f_battery =      1;
	// f_hw_sensor_err =1;
	// f_hw_high38     =1;
	// f_ld_high =      1;
	// f_ld_low =       1;
	// f_lc_high =      1;
	// f_lc_low =       1;
	// f_power_off  =   1;
	// f_voltage_err =  1;
}
/**********************************/
void JudgeLdErr(void) //冷冻传感器故障
{
	if (r16_ldad > 1010 || r16_ldad < 15)
	{
		if (!f_ld_sensor_err) //如果出现冷冻传感器故障,进入一次,以后不再进入
		{
			f_ld_sensor_err = 1;
			f_stop_alarm = 0;
		}
	}
	else if (f_ld_sensor_err)
	{
		f_ld_sensor_err = 0;
		f_ld_first_disp = 0;
	}
}
/**********************************/
void JudgeLcErr(void) //冷藏传感器故障
{
	if (r_lcad_12b > 250 * 16 || r_lcad_12b < 5 * 16)
	{
		if (!f_lc_sensor_err)
		{
			f_lc_sensor_err = 1;
			f_stop_alarm = 0;
		}
	}
	else if (f_lc_sensor_err)
	{
		f_lc_sensor_err = 0;
		f_lc_first_disp = 0;
	}
}
/**********************************/
void JudgeHwErr(void) //环温传感器故障
{
	if (r_hwad > 240 || r_hwad < 5)
	{
		if (!f_hw_sensor_err)
		{
			f_hw_sensor_err = 1;
		}
	}
	else
	{
		f_hw_sensor_err = 0;
	}
}
/*********************************/
void JudgeHwHigh(void) //环温超38
{
	if (f_hw_sensor_err)
	{
		f_hw_high38 = 0;
	}
	else if (r_hwsjwd > 76) //>38
	{
		if (!f_hw_high38)
		{
			f_hw_high38 = 1;
		}
	}
	else if (r_hwsjwd < 76)
	{
		f_hw_high38 = 0;
	}
}
/**************************************************/
void JudgeLdHigh(void)
{
	//冷冻传感器错误
	if (f_ld_sensor_err || (!ldyj))
	{
		f_ld_high = 0;
		f_ld_high_buzz = 0;
		t_ld_high_buzz = t_tens;
	}
	//高温报警,初次上电经延迟时间后FMQ报警,此后15分钟FMQ报警
	else if (r_ldxswd > (r_ldzt + r_ld_high_alarm)) //显示和设定温度都上偏200
	{
		f_ld_high = 1;
		if (f_Powerupdelayld) //初次冷冻上电延迟时间+15min后FMQ报警
		{
			if ((unsigned char)(t_tens - t_ld_high_buzz) >= 90) //15min
			{
				if (!f_ld_high_buzz)
				{
					f_ld_high_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else
		{
			t_ld_high_buzz = t_tens;
		}
	}
	//高温报警正常
	else if (r_ldxswd < (r_ldzt + r_ld_high_alarm))
	{
		f_ld_high = 0;
		f_ld_high_buzz = 0;
		t_ld_high_buzz = t_tens;
	}
}
/******************************/
void JudgeLcHigh(void)
{
	//冷藏传感器错误
	if (f_lc_sensor_err || (!lcyj))
	{
		f_lc_high = 0;
		f_lc_high_buzz = 0;
		t_lc_high_buzz = t_tens;
	}
#if (LC_DISP_RESOLUTION_0D1 || LC_RESOLUTION_0D1) //显示分辨率0.1度
	else if (r_lcxswd_float > (r_lczt_float + r_lc_high_alarm))
#else
	else if (r_lcxswd > (r_lczt + r_lc_high_alarm))
#endif
	{
		f_lc_high = 1;
		if (f_Powerupdelaylc) ////if(f_Powerupdelaylc&&!f_door_switch) 11.02.23wys开门状态高温15min报警
		{
			if ((unsigned char)(t_tens - t_lc_high_buzz) >= 90) //15min
			{
				if (!f_lc_high_buzz)
				{
					f_lc_high_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else
		{
			t_lc_high_buzz = t_tens;
		}
	}
#if (LC_DISP_RESOLUTION_0D1 || LC_RESOLUTION_0D1) //显示分辨率0.1度
	else if (r_lcxswd_float < (r_lczt_float + r_lc_high_alarm))
#else
	else if (r_lcxswd < (r_lczt + r_lc_high_alarm))
#endif
	{
		f_lc_high = 0;
		f_lc_high_buzz = 0;
		t_lc_high_buzz = t_tens;
	}
}
/******************************/
void JudgeLdLow(void)
{
	if (f_ld_sensor_err || (!ldyj))
	{
		f_ld_low = 0;
		f_ld_low_buzz = 0;
		t_ld_low_buzz = t_tens;
	}
	else if (r_ldxswd < (r_ldzt - r_ld_low_alarm))
	{
		f_ld_low = 1;
		if (f_Powerupdelayld)
		{
			if ((unsigned char)(t_tens - t_ld_low_buzz) >= 90) //15min
			{
				if (!f_ld_low_buzz)
				{
					f_ld_low_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else
		{
			t_ld_low_buzz = t_tens;
		}
	}
	else if (r_ldxswd > (r_ldzt - r_ld_low_alarm))
	{
		f_ld_low = 0;
		f_ld_low_buzz = 0;
		t_ld_low_buzz = t_tens;
	}
}
/******************************/
void JudgeLcLow(void)
{

	if (f_lc_sensor_err || (!lcyj))
	{
		f_lc_low = 0;
		f_lc_low_buzz = 0;
		t_lc_low_buzz = t_tens;
	}
#if (LC_DISP_RESOLUTION_0D1 || LC_RESOLUTION_0D1) //显示分辨率0.1度
	else if ((r_lcxswd_float < (r_lczt_float - r_lc_low_alarm)) || (r_lcxswd_float < 38))
#else
	else if ((r_lcxswd < (r_lczt - r_lc_low_alarm)) || (r_lcxswd < 38))
#endif
	{
		f_lc_low = 1;
		if (f_Powerupdelaylc)
		{
			if ((unsigned char)(t_tens - t_lc_low_buzz) >= 90) //15min
			{
				if (!f_lc_low_buzz)
				{
					f_lc_low_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else
		{
			t_lc_low_buzz = t_tens;
		}
	}
#if (LC_DISP_RESOLUTION_0D1 || LC_RESOLUTION_0D1) //显示分辨率0.1度
	else if (r_lcxswd_float > (r_lczt_float - r_lc_low_alarm))
#else
	else if (r_lcxswd > (r_lczt - r_lc_low_alarm))
#endif
	{
		f_lc_low = 0;
		f_lc_low_buzz = 0;
		t_lc_low_buzz = t_tens;
	}
}
/*********************************************************/
void JudgeVoltageErr(void)
{
	if (f_power_off)
	{
		f_voltage_err = 0;
		f_voltage_buzz = 0;
		t_voltage_buzz = t_halfsec;
	}
	//220V
	else if (f_voltage_slect == V220)
	{
		if (r_voltage < 196 || r_voltage > 238)
		{
			f_voltage_err = 1;
			if ((t_halfsec - t_voltage_buzz) >= 120) //1min
			{
				if (!f_voltage_buzz)
				{
					f_voltage_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else if (r_voltage > 196 && r_voltage < 238)
		{
			f_voltage_err = 0;
			f_voltage_buzz = 0;
			t_voltage_buzz = t_halfsec;
		}
	}
	//110V
	else
	{
		if (r_voltage < 99 || r_voltage > 122)
		{
			f_voltage_err = 1;
			if ((t_halfsec - t_voltage_buzz) >= 120) //1min/////////////规格书是30s
			{
				if (!f_voltage_buzz)
				{
					f_voltage_buzz = 1;
					f_stop_alarm = 0;
				}
			}
		}
		else if (r_voltage > 99 && r_voltage < 122)
		{
			f_voltage_err = 0;
			f_voltage_buzz = 0;
			t_voltage_buzz = t_halfsec;
		}
	}
}
/*********************************/
void JudgePowerOff(void)
{

	if (r_voltage < 70)
	{
		//f_power_off = 1;
		if ((t_halfsec - t_power_Off) >= 6) //低电压持续3s，则报断电 @20181226 CFJ
		{
			f_power_off = 1;
		}

		if ((t_halfsec - t_power_buzz) >= 60) //30s
		{
			if (!f_power_buzz)
			{
				f_power_buzz = 1;
				f_stop_alarm = 0;
			}
		}
	}
	else
	{
		f_power_off = 0;
		f_power_buzz = 0;
		t_power_buzz = t_halfsec;
		t_power_Off = t_halfsec; //@20181226 CFJ 掉电的时间
	}
}
/*********************************/
void JudgeBattery(void)
{
	/* //@20181130 CFJ
		if(r_battery_ad<127)//10.43V
		{
			f_battery = 1;
		}
		else if(r_battery_ad>129)
		{
			f_battery = 0;
		}
		*/
}

/***********************************************************
*Name         :  DelayControl
*Function     :  Delay some time
*Input Value  :  Delay Cnt
*Output Value :  None
*Introduction :
***********************************************************/
void DelayControl(uchar R8_DelayCnt)
{
    int i = 0;
	for (; R8_DelayCnt > 0; R8_DelayCnt--)
	{
        for(i = 0; i< 16; i++)  //由4MHz倍频到了64MHz,快了16倍，所以nop变为原来16倍
        {
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
            nop;
        }
	}
}
/*****************Data to stled361s******************/
/****************************************************/
void LedWriteByte(unsigned char led_data);
void LedSendScl(void);
void LedBegin(void);
void LedStop(void);
/****************************************************/
void DataToLed(void)
{
	if ((!f_first_ad) && SelfCheckFlag == 0) //if(!f_first_ad) //@20190221 CFJ
		return;
	if ((unsigned char)(t_onems - t_data_to_led) >= 125) //125ms
	{
		t_data_to_led = t_onems;
		LedBegin();
		LedWriteByte(0x00); //write,bank0,address0,address auto add

		LedWriteByte(r_led12); //冷冻数码管  第2位
		LedWriteByte(r_led13); //冷冻数码管  第3位
		LedWriteByte(r_led34); //报警和锁定指示灯

		LedWriteByte(r_led21); //冷藏数码管  第1位
		LedWriteByte(r_led22); //冷藏数码管  第2位
		LedWriteByte(r_led23); //冷藏数码管  第3位

