191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
			goto NotSaveKey2;
		}
	}
	else if (r_keyz == KEY_DEFROST) //化霜
	{
		if (!f_lock)
		{
			if (f_key_defrost)
			{
				f_key_defrost = OFF;
			}
			else
			{
				f_key_defrost = ON;
				f_key_defrost_disp = 1;
				t_ld_err_disp = t_halfsec;
			}
			f_compressor_on_dly = 1;
			f_on_off_dly = 0;
			goto NotSaveKey2;
		}
	}
	else if (r_keyz == KEY_BJYCSJ) //FMQ报警延迟时间
	{
		if (!f_lock)
		{
			u8_ld_bjycsjx = u8_ld_bjycsj;
			u8_lc_bjycsjx = u8_lc_bjycsj;
			if (r_set_state == SET_NC_LD)
			{
				r_set_state = SET_LD_BJYCSJ;
			}
			else
			{
				r_set_state = SET_LC_BJYCSJ;
			}
			goto NotSaveKey2;
		}
	}
	else if (r_keyz == KEY_DATE)
	{
		if (!f_lock)
		{
			if (r_set_state < 31)
			{
				r1 = r_set_state;
			}
			if (r_set_state <= 32) //zyj  100621
			{
				r_set_state = SET_YEAR;
			}
			goto NotSaveKey2;
		}
	}
	else if (r_keyz == KEY_UsbCheck) //usb查询
	{
		if (!f_lock)
		{
			if (r_set_state < 31)
			{
				r1 = r_set_state;
			}
			if (r_set_state != 31)
			{
				r_set_state = USB_Insert_Or_PullOut;
			}
			goto NotSaveKey2;
		}
	}
    else if (r_keyz == KEY_DISABLE_BUZZ) //长摁蜂鸣取消键，进入wifi配置模式
	{
		//if (!f_lock)
		{
			f_Enter_WifiCfg = 1;
			goto NotSaveKey2;
		}
	}
	return;
NotSaveKey2:
	BuzzBi();
	f_key_kp = 1;
}
//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
void AutoLock(void)
{
	if ((t_halfsec - t_auto_lock) >= 20)
	{
		f_lock = 1;
        if (r_set_state1 == SET_F1 || r_set_state1 == SET_F0 )	  // 解锁过程中超时自动退出，正常显示温度   2021-1-15  wpf
		{
			r_set_state1 = SET_NC;
		}
		if (r_set_state == SET_LD)
		{
			if ((r_swtj * 10 + r_gwtj) >= 10 && (r_swtj * 10 + r_gwtj) <= 45)
			{
				r_ldzt = 200 - (r_swtj * 10 + r_gwtj);
				f_need_write_e2 = ON;
				t_write_e2 = t_halfsec;
			}
			else
			{
				BuzzBiBiBi();
			}
		}
		else if (r_set_state == SET_LD_HIGH)
		{
			if (f_zf == ZHENG_SIGN)
			{
				if ((r_swtj * 10 + r_gwtj) > 50)
				{
					BuzzBiBiBi();
				}
				else
				{
					r_ld_high_alarm = r_swtj * 10 + r_gwtj + 200 - r_ldzt;
					f_need_write_e2 = ON;
					t_write_e2 = t_halfsec;
				}
			}
			else
			{
				if ((200 - (r_swtj * 10 + r_gwtj)) < (r_ldzt + 1))
				{
					BuzzBiBiBi();
				}
				else
				{
					r_ld_high_alarm = 200 - (r_swtj * 10 + r_gwtj) - r_ldzt;
					f_need_write_e2 = ON;
					t_write_e2 = t_halfsec;
				}
			}
		}
		else if (r_set_state == SET_LD_LOW)
		{
			if (f_zf == ZHENG_SIGN)
			{
				BuzzBiBiBi();
			}
			else
			{
				if ((200 - (r_swtj * 10 + r_gwtj)) < 140)
				{
					BuzzBiBiBi();
				}

				else if ((200 - (r_swtj * 10 + r_gwtj)) > (r_ldzt - 1))
				{
					BuzzBiBiBi();
				}
				else
				{
					r_ld_low_alarm = r_ldzt - (200 - (r_swtj * 10 + r_gwtj));
					f_need_write_e2 = ON;
					t_write_e2 = t_halfsec;
				}
			}
		}
		else if (r_set_state == SET_LC)
		{
			//if(((r_swtj*10+r_gwtj)<=16)&&((r_swtj*10+r_gwtj)>=5))//20171106  if((r_swtj*10+r_gwtj)<=16)
			if (((r_swtj * 10 + r_gwtj) <= LC_SET_TEMP_MAX) && ((r_swtj * 10 + r_gwtj) >= LC_SET_TEMP_MIN)) //  2019-9-11 王潘飞
			{
				r_lczt = 38 + (r_swtj * 10 + r_gwtj);
				r_lczt_float = r_lczt;
				if (r_lczt < (LC_SET_TEMP_MIN + 38))
				{
					r_lc_low_alarm = r_lczt - 38;
				}
				else
				{

					if (r_lc_low_alarm < 1) //20180312
					{
						r_lc_low_alarm = 1;
					}
				}
				f_need_write_e2 = ON;
				t_write_e2 = t_halfsec;
			}
			else
			{
				BuzzBiBiBi();
			}
		}
		else if (r_set_state == SET_LC_HIGH)
		{
			if (f_zf == ZHENG_SIGN)
			{
				if ((r_swtj * 10 + r_gwtj) > 50 || (38 + (r_swtj * 10 + r_gwtj)) < (r_lczt + 1))
				{
					BuzzBiBiBi();
				}
				else
				{
					r_lc_high_alarm = r_swtj * 10 + r_gwtj + 38 - r_lczt;
					f_need_write_e2 = ON;
					t_write_e2 = t_halfsec;
				}
			}
			else
			{
				BuzzBiBiBi();
			}
		}
		else if (r_set_state == SET_LC_LOW)
		{
			if (f_zf == ZHENG_SIGN)
			{
				if ((38 + (r_swtj * 10 + r_gwtj)) > (r_lczt - 1)) //低温报警值等于或大于设置温度
				{
					BuzzBiBiBi();
				}
				else
				{
					if (r_lczt >= (LC_SET_TEMP_MIN + 38))
					{
						r_lc_low_alarm = r_lczt - (38 + (r_swtj * 10 + r_gwtj));
					}
					else
					{
						r_lc_low_alarm = r_lczt - 38;
					}
					f_need_write_e2 = ON;
					t_write_e2 = t_halfsec;
				}
			}
			else //负值强制为0
			{
				r_lc_low_alarm = r_lczt - 38;
				f_need_write_e2 = ON;
				t_write_e2 = t_halfsec;
			}
		}
		else if (r_set_state == SET_LD_WDJZ)
		{
			r_ldwdjz = r_ldwdjzx;
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LC_WDJZ)
		{
			r_lcwdjz = r_lcwdjzx;
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LCYJ_DELAY)
		{
			t_yj_delay = t_yj_delayx;
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LD_BJYCSJ)
		{
			u8_ld_bjycsj = u8_ld_bjycsjx;
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LC_BJYCSJ)
		{
			u8_lc_bjycsj = u8_lc_bjycsjx;
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LDYJ)
		{
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		else if (r_set_state == SET_LCYJ)
		{
			f_need_write_e2 = ON;
			t_write_e2 = t_halfsec;
		}
		if (r_set_state == 31)
		{
			r_set_state = r1;
		}
		else if (r_set_state >= 32) //zyj 100621
		{
			r_set_state = r1;
			//  report_time =  1;
			//  t_report_time = t_20ms;
			//  u16_random_time = u16_random;
		}
		else if (r_set_state >= 15)
			r_set_state = SET_NC_LC;
		else
			r_set_state = SET_NC_LD;
	}
}

/******************************************************/
/****************判断压机开停程序**********************/
/******************************************************/
void ldCompressorRun10Hour(void);
void ldCompRunOneHour(void);
/******************************************************/
void LdCompressorJudge(void) //冷冻压机判断
{
	unsigned int r16_on_ad;
	unsigned int r16_off_ad;

