191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
#if LD_COMP_RUN_MAX_1_HOUR
	ldCompRunOneHour();
#elif LD_COMP_RUN_MAX_10_HOUR
	ldCompressorRun10Hour();
#endif

	// ldCompressorRun10Hour();
	// ldCompRunOneHour();

	if (!f_first_ad)
		return;
	if ((uchar)(t_tens - t_on_off_dly) >= 6)
	{
		f_on_off_dly = 0; //开停机压机延迟1分钟
	}

	if (f_power_off)
	{
		f_compressor_on_dly = 0;
		t_yj_dly_time = 0;
		goto CompressorOff;
	}
	if (!ldyj)
	{
		goto CompressorOff;
	}

	if (f_key_defrost == ON)
	{
		goto CompressorOff;
	}
	if (f_ldCompressorProtect) //压机10小时保护
	{
		goto CompressorOff;
	}
	if (f_ldComp1HourProtect) //压机1小时保护
	{
		goto CompressorOff;
	}
	if (f_ld_sensor_err)
	{
		if (f_onemin)
		{
			t_compressor++;
		}
		if (t_compressor < 30)
		{
			goto CompressorOn;
		}
		else if (t_compressor < 40)
		{
			goto CompressorOff;
		}
		else
		{
			t_compressor = 0;
			goto CompressorOn;
		}
	}
	t_compressor = 0;
	r16_on_ad = tab_on[r_ldzt - 10];
	r16_off_ad = tab_off[r_ldzt - 10];
	if (f_compressor == ON)
	{
		if (r16_ldad > r16_off_ad)
			goto CompressorOff;
	}
	else
	{
		if (r16_ldad < r16_on_ad)
			goto CompressorOn;
	}
	return;

CompressorOn:
	if (f_compressor_on_dly && !f_on_off_dly)
	{
		if (!f_compressor && delay_10sec)
		{
			f_compressor = ON;
			f_on_off_dly = 1;
			t_on_off_dly = t_tens;
			t_yj_delay_10sec = 0;
			delay_10sec = 0;
		}
	}
	return;
CompressorOff:
	//if(!f_on_off_dly)
	{
		if (f_compressor)
		{
			f_compressor = OFF;
			f_on_off_dly = 1;
			t_on_off_dly = t_tens;
		}
	}
	return;
}
/************************************************/
void Compressor_on_delay(void) //上电压机延迟开时间  由按键设定
{
	if (!f_compressor_on_dly)
	{
		if (f_tens)
		{
			t_yj_dly_time++;
			if (t_yj_dly_time >= (t_yj_delay * 6))
			{
				f_compressor_on_dly = 1;
				t_yj_dly_time = 0;
			}
		}
	}
}
/**************************************************/
void Compressor_delay_10sec(void)
{
	if (!delay_10sec)
	{
		if (f_halfsec)
		{
			t_yj_delay_10sec++;
			if (t_yj_delay_10sec >= 20)
			{
				t_yj_delay_10sec = 0;
				delay_10sec = 1;
			}
		}
	}
}
/************冷冻压机连续运行10小时程序**************/
/************************************************/
void ldCompressorRun10Hour(void)
{
	if (!f_ldCompressorProtect)
	{
		if (!f_compressor)
		{
			u8_CompMin = 0;
			u8_CompHour = 0;
			return;
		}
		if (f_onemin)
		{
			if (++u8_CompMin >= 60)
			{
				u8_CompMin = 0;
				if (++u8_CompHour >= 10)
				{
					u8_CompHour = 0;
					f_ldCompressorProtect = 1;
					u8_CompStopTime = t_tens;
					// f_on_off_dly = 0;
				}
			}
		}
	}
	else
	{
		if ((unsigned char)(t_tens - u8_CompStopTime) >= 60) //10min
		{
			f_ldCompressorProtect = 0;
		}
	}
}

/************************************************/
/************冷冻压机连续运行1小时程序**************/
/************************************************/
void ldCompRunOneHour(void)
{
	if (!f_ldComp1HourProtect)
	{
		if (!f_compressor || (r_ldgzwd != r_ldzt))
		{
			u8_CompRunMin = 0;
			return;
		}
		if (f_onemin)
		{
			if (++u8_CompRunMin >= 60)
			{
				u8_CompRunMin = 0;
				f_ldComp1HourProtect = 1;
				u8_CompStop5min = t_tens;
				// f_on_off_dly = 0;
			}
		}
	}
	else
	{
		if ((uchar)(t_tens - u8_CompStop5min) >= 30) //5min
		{
			f_ldComp1HourProtect = 0;
		}
	}
}
/************************************************/
void lcCompRunOneHour(void);
/****************冷藏压机控制程序****************/
void Lc_CompressorJudge(void)
{
#if LC_COMP_RUN_MAX_1_HOUR
	lcCompRunOneHour();   //连续运行x小时，停机保护
#endif
	if (!f_first_ad)
		return;

	if ((uchar)(t_tens - t_lc_on_off_dly) >= 6) //1min   HW 20190814
	{
		f_lc_on_off_dly = 0;
	}
	if (f_power_off)
	{
		f_compressor_on_dly = 0;
		t_yj_dly_time = 0;
		goto Lc_CompressorOff;
	}
	if (!lcyj)
	{
		goto Lc_CompressorOff;
	}
	if (f_lcComp1HourProtect) //压机连续运行x小时，停机保护
	{
		goto Lc_CompressorOff;
	}
	if (f_lc_sensor_err)
	{
		if (f_onemin)
		{
			t_lc_compressor++;
		}
		if (t_lc_compressor < 15)
		{
			goto Lc_CompressorOn;
		}
		else if (t_lc_compressor < 30)
		{
			goto Lc_CompressorOff;
		}
		else
		{
			t_lc_compressor = 0;
			goto Lc_CompressorOn;
		}
	}
	t_lc_compressor = 0;
	if (f_lc_compressor == ON)
	{
        if(r_lcwd_float < (r_lczt_float - 0.7))
			goto Lc_CompressorOff;
	}
	else
	{
        if(r_lcwd_float > (r_lczt_float + 0.7))
			goto Lc_CompressorOn;
	}
	return;
Lc_CompressorOn:
	if (f_compressor_on_dly && !f_lc_on_off_dly)
	{
		if (!f_lc_compressor && delay_10sec)
		{
			f_lc_compressor = ON;
			f_lc_fan = ON;
			f_lc_on_off_dly = 1;
			t_lc_on_off_dly = t_tens;
			t_yj_delay_10sec = 0;
			delay_10sec = 0;
		}
	}
	return;
Lc_CompressorOff:
	if (!f_lc_on_off_dly)
	{
		if (f_lc_compressor)
		{
			f_lc_compressor = OFF;
			f_lc_fan = OFF;
			f_lc_on_off_dly = 1;
			t_lc_on_off_dly = t_tens;
		}
	}
	return;
}

/************冷藏压机连续运行x小时程序,强制停机y分钟**************/
/***************************************************/
void lcCompRunOneHour(void)
{
	if (!f_lcComp1HourProtect)
	{
		if (!f_lc_compressor)
		{
			u8_lcCompRunMin = 0;
			return;
		}
		if (f_onemin)
		{
			if (++u8_lcCompRunMin >= 60 * 2)  //连续运行x小时，强制停机y分钟
			{
				u8_lcCompRunMin = 0;
				f_lcComp1HourProtect = 1;
				u8_lcCompStop5min = t_tens;
				//f_on_off_dly = 0;
			}
		}
	}
	else
	{
		if ((uchar)(t_tens - u8_lcCompStop5min) >= 42) //7min
		{
			f_lcComp1HourProtect = 0;
		}
	}
}
/********************判断风机程序*****************/
/*************************************************/
void LnFan(void)
{
	if (f_power_off)
	{
		f_ln_fan = OFF;
	}
	else if (f_compressor == ON)
	{
		f_ln_fan = ON;
		t_fan2min = t_tens;
	}
	else
	{
		if ((unsigned char)(t_tens - t_fan2min) >= 12) //2min
		{
			f_ln_fan = OFF;
		}
	}
}

/********************判断冷藏照明灯程序****************/
void Lc_lightProg(void)
{
    static unsigned char t_open_ms = 0;
	if (!DOOR_ONFLAG | !LED_ONFLAG) //if(!PTBD_PTBD7|!PTDD_PTDD0)
	{
		if ((uchar)(t_onems - t_lightms) >= 60)
			LED_OUT = 1; //PTDD_PTDD2=1;   @20180920 cfj
		f_LightStatusPin = 1;
	}
	else
	{
		t_lightms = t_onems;
		LED_OUT = 0; //PTDD_PTDD2=0;      @20180920 cfj
		f_LightStatusPin = 0;
	}

    //检测门状态
    if(!DOOR_ONFLAG)
    {
        if ((uchar)(t_onems - t_open_ms) >= 60)
        {
            f_door_state = 1;
        }
    }
    else
    {
        t_open_ms = t_onems;
        f_door_state = 0;
    }
}
/********************内胆风机程序****************/
void Nd_fan_Prog(void)
{
	if (DOOR_ONFLAG) //if(PTBD_PTBD7)    @20180920 cfj
	{
		f_door_switch = 0; // 100526  zyj
		if (lcyj)
		{
			if ((uchar)(t_onems - t_nd_fan) >= 60)
			{
				f_nd_fan = 1;
			}
		}
		else
		{
			t_nd_fan = t_onems;
			f_nd_fan = 0;
		}
	}
	else
	{
		f_door_switch = 1;
		t_nd_fan = t_onems;
		f_nd_fan = 0;
	}
}
/***********开门报警程序***************/ /////wys11.03.19
void Door_Open(void)
{
	if (f_door_switch) //开门
	{
		f_door_open = 1;
		if ((unsigned char)(t_tens - t_door) >= 90) //15min
		{
			if (!f_dooropen_buzz)
			{
				f_dooropen_buzz = 1;
				f_stop_alarm = 0;
			}
		}
	}
	else
	{
		f_door_open = 0;
		f_dooropen_buzz = 0;
		t_door = t_tens;
	}
}
/********************按键除霜程序****************/
void Defrost_Prog(void)
{
	if (f_key_defrost)
	{
		f_defrost = 1;
	}
	else
	{
		f_defrost = 0;
	}
}

