191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
/****************************************************/
/***************更新设定值程序***********************/
/****************************************************/
void WriteToE2(void)
{
	if (f_need_write_e2)
	{
		if ((t_halfsec - t_write_e2) >= 4) //2s
		{
			f_need_write_e2 = 0;
			f_e2prom = 1;
		}
	}
}

/****************************************************/
/**********II2 BUS***********************************/
/****************************************************/
/*need define in your .h file:f_e2prom,C_sda,C_scl,
  C_sdaddr,in,out*/
void Begin(void);
void Stop(void);
void Sendscl(void);
void WriteByte(unsigned char tem_dat);
unsigned char ReadByte(void);
/*****************************************************/

//^^^^^^^^^^^^^^^^^^^^^^^^^^


void WriteE2(void)
{
	if (f_e2prom)
	{
		Begin();
		WriteByte(0xA0); ///write chip addres 0xa0      每页64个字节，可以连续写
		WriteByte(0x00); ///write data high addres
		WriteByte(0x00); ///write data low  addres

		WriteByte(r_ldzt);			///write data //byte1
		WriteByte(t_yj_delay);		//byte2
		WriteByte(r_ldwdjz);		//byte3
		WriteByte(r_ld_high_alarm); //byte4
		WriteByte(r_ld_low_alarm);  //byte5
		WriteByte(r_lczt);			//byte6
		WriteByte(r_lc_high_alarm); //byte7
		WriteByte(r_lc_low_alarm);  //byte8

		WriteByte(flag_ajszyjkt & 0x03); //write data  //byte9
		WriteByte(r_lcwdjz);			 //byte10
		WriteByte(u8_ld_bjycsj);		 //byte11
		WriteByte(u8_lc_bjycsj);		 //byte12
		WriteByte(0xBC);				 //byte13

		C_sda = 1;
		Stop();
		f_e2prom = 0;
	}
}
//^^^^^^^^^^^^^^^^^^^^^^^^^^
void ReadE2(void)
{
	unsigned char temp;
	Begin();
	WriteByte(0xA0); ///write chip addres 0xa0
	WriteByte(0x00); ///write data addres
	WriteByte(0x00);
	Begin();
	WriteByte(0xA1); ///write chip addres 0xa0

	r_ldzt = ReadByte(); //byte1冷冻设定
	Sendscl();

	t_yj_delay = ReadByte(); //byte2压机延迟时间
	t_yj_delayx = t_yj_delay;
	Sendscl();

	r_ldwdjz = ReadByte(); //byte3冷冻校准值
	r_ldwdjzx = r_ldwdjz;
	Sendscl();

	r_ld_high_alarm = ReadByte(); //byte4冷冻高温报警设定的差值
	Sendscl();

	r_ld_low_alarm = ReadByte(); //byte5
	Sendscl();

	r_lczt = ReadByte(); //byte6//冷藏设定温度
	r_lczt_float = r_lczt;
	Sendscl();

	r_lc_high_alarm = ReadByte(); //byte7
	Sendscl();

	r_lc_low_alarm = ReadByte(); //byte8 //冷藏低温报警设定的差值
	Sendscl();

	flag_ajszyjkt = ReadByte() & 0x03; //byte9按键设置压机开停
	Sendscl();

	r_lcwdjz = ReadByte(); //byte10冷藏温度校准值
	r_lcwdjzx = r_lcwdjz;
	Sendscl();

	u8_ld_bjycsj = ReadByte(); //byte11冷冻报警延迟时间
	u8_ld_bjycsjx = u8_ld_bjycsj;
	Sendscl();

	u8_lc_bjycsj = ReadByte(); //byte12
	u8_lc_bjycsjx = u8_lc_bjycsj;
	Sendscl();

	temp = ReadByte(); //byte13
	C_sda = 1;
	Sendscl();
	Stop();

	r_ldzt_report = r_ldzt;
	r_lczt_report = r_lczt;
	ld_high_alarm_report = r_ld_high_alarm;
	ld_low_alarm_report = r_ld_low_alarm;
	lc_high_alarm_report = r_lc_high_alarm;
	lc_low_alarm_report = r_lc_low_alarm;
	if (temp != 0xBC)
	{
		r_ldzt = 160; //-40
		r_lczt = 43;  //5°C
		r_lczt_float = r_lczt;
		t_yj_delayx = 0;
		t_yj_delay = 0;
		r_ldwdjzx = 10;
		r_ldwdjz = 10;
		r_ld_high_alarm = 5;
		r_ld_low_alarm = 5;
		r_lc_high_alarm = 3;
		r_lc_low_alarm = 3;
		r_lcwdjzx = 100;
		r_lcwdjz = 100;
		u8_ld_bjycsjx = 2; //冷冻报警延迟时间,小时
		u8_ld_bjycsj = 2;
		u8_lc_bjycsjx = 2;
		u8_lc_bjycsj = 2;
		flag_ajszyjkt = 0x03; //按键设置压机开停用
		f_e2prom = 1;

		r_ldzt_report = 160;
		r_lczt_report = 43;
		ld_high_alarm_report = 5;
		ld_low_alarm_report = 5;
		lc_high_alarm_report = 3;
		lc_low_alarm_report = 3;
	}
}
//^^^^^^^^^^^^^^^^^
void WriteByte(unsigned char tem_dat)
{
	unsigned char w_clk;

	C_sdaddr = out; //1

	for (w_clk = 8; w_clk != 0; w_clk--)
	{
		DelayControl(4);
		if (tem_dat & 0x80)
			C_sda = 1;
		else
			C_sda = 0;
		tem_dat = tem_dat << 1;
		DelayControl(4);
		Sendscl(); //ack signal
	}
	C_sda = 1;
	C_sdaddr = in;
	w_clk = 0xFF;
	Sendscl();		//ack signal
	while (!C_sda1) //while(!C_sda)
	{
		w_clk--;
		DelayControl(4);
		if (w_clk == 0)
			break;
	}
	C_sdaddr = out;
}
//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
unsigned char ReadByte(void)
{
	unsigned char r_dat, r_clk;
	C_sda = 1;
	C_sdaddr = in;

	for (r_clk = 8; r_clk > 0; r_clk--)
	{
		C_scl = 1;
		DelayControl(4);
		r_dat = r_dat << 1;

		if (C_sda1) //if(C_sda)
			r_dat |= 0x01;
		else
			r_dat &= 0xfe;

		C_scl = 0;
		DelayControl(4);
	}
	C_sdaddr = out;
	DelayControl(4);
	C_sda = 0;

	return (r_dat);
}
/*****************************/
void Begin(void)
{
	C_sdaddr = out;
	C_sda = 1;
	DelayControl(4);
	C_scl = 1;
	DelayControl(4);
	C_sda = 0;
	DelayControl(4);
	C_scl = 0;
	DelayControl(4);
}
//--------------------------
void Stop(void)
{
	C_sda = 0;
	DelayControl(4);
	C_scl = 1;
	DelayControl(4);
	C_sda = 1;
	DelayControl(4);
}
//---------------
void Sendscl(void)
{
	C_scl = 1;
	DelayControl(4);
	C_scl = 0;
	DelayControl(4);
}

uchar u8_Rec2data[20];
uchar u8_Send2data[20];
uchar u8_Send2dataMemory[20];

uchar u8_Rec2_data_Num;
uchar u8_Send2_data_Num;
uchar u8_Send2_data_Num_Count;
uchar u8_Rec2_data_State;
uchar u8_Send2_data_State;

void GetSum2(void)
{
	uchar r_checksum = 0, count;

	u8_Send2dataMemory[0] = 0x55;
	u8_Send2dataMemory[1] = 0xFF;
	u8_Send2dataMemory[2] = u8_Send2_data_Num;

	r_checksum = u8_Send2_data_Num;

	for (count = 0; count < u8_Send2_data_Num - 1; count++)
	{
		r_checksum = r_checksum + u8_Send2data[count];
		u8_Send2dataMemory[count + 3] = u8_Send2data[count];
	}

	u8_Send2dataMemory[count + 3] = r_checksum;
	u8_Send2_data_Num = u8_Send2_data_Num + 3;

	SendData(u8_Send2dataMemory, u8_Send2_data_Num); 
}

void ReturnPrintFrame(void)
{

	uchar data;
    unsigned char  data1;
	// if (u8_Send2_data_State == 1)
	// {
	// 	return;
	// }

	u8_Send2_data_Num = 0x10;
	//45;
	//u8_Send2data[0] = 0x55;
	//u8_Send2data[1] = 0xFF;
	//u8_Send2data[2] = 0x10;
	u8_Send2data[0] = 0x0;
	u8_Send2data[1] = 0x0;
	u8_Send2data[2] = 0x0;
	u8_Send2data[3] = 0x0;
	u8_Send2data[4] = 0x0;
	u8_Send2data[5] = 0x01;
	u8_Send2data[6] = 0x02;
	u8_Send2data[7] = 0x4D;
	u8_Send2data[8] = 0x05;

    if (r_lcxswd_float >= 38.0)  //正温度
    {
        data = (unsigned int)((r_lcxswd_float - 38) * 10) / 10;  //整数部分
		data1 = (unsigned int)((r_lcxswd_float - 38) * 10) % 10;  //小数部分
        u8_Send2data[9] = (data >> 4) & 0x0F;
        u8_Send2data[10] = (data << 4) & 0xF0;
    }
    else  //负温度
    {
        data = (unsigned int)((38.0 - r_lcxswd_float) * 10) / 10;  //整数部分
		data1 = (unsigned int)((38.0 - r_lcxswd_float) * 10) % 10;  //小数部分
        u8_Send2data[9] = (data >> 4) & 0x0F;
        u8_Send2data[9] = u8_Send2data[9] | 0x80;
        u8_Send2data[10] = (data << 4) & 0xF0;
    }
	switch(data1)  	//显示温度小数部分
	{
		case 0: u8_Send2data[10] |= 0x00; break;
		case 1: u8_Send2data[10] |= 0x01; break;
		case 2: u8_Send2data[10] |= 0x03; break;
		case 3: u8_Send2data[10] |= 0x04; break;
		case 4: u8_Send2data[10] |= 0x06; break;
		case 5: u8_Send2data[10] |= 0x08; break;
		case 6: u8_Send2data[10] |= 0x09; break;
		case 7: u8_Send2data[10] |= 0x0b; break;
		case 8: u8_Send2data[10] |= 0x0c; break;
		case 9: u8_Send2data[10] |= 0x0e; break;
		default:break;
	}

