191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
	}
	else
	{
		
		ReturnVoidFrame();

	}
	
}
/************************************************/
/*******************返回状态帧程序***************/
/************************************************/
void ReturnStateFrame(void)
{
    static short temp;

	if (f_send_1ff || f_send_2ff || f_send_data)
	{
		return;
	}
	r_sendsum = 0x2d; //45;
	send_net[0] = rec_net[0];
	send_net[1] = rec_net[1];
	send_net[2] = rec_net[2];
	send_net[3] = rec_net[3];
	send_net[4] = rec_net[4];
	send_net[5] = rec_net[5];
	send_net[6] = 0x02;

	send_net[7] = 0x6d;
	send_net[8] = 0x01;

	send_net[9] = 0x00;
	send_net[10] = 0x00;

	send_net[11] = 0x00;  //电压
	send_net[12] = r_voltage; //电压

	send_net[13] = 0x00;
	send_net[14] = 0x00;

    /*协议标志 V2*/
	send_net[15] = 0xFF;      
	send_net[16] = 0xF2; 

    /*冷藏显示温度（0.1精度）*/
    temp = (short)((r_lcxswd_float - 38.0) * 10);
    if(temp < 0)
        temp = 0x8000 | abs(temp);
	send_net[17] = temp >> 8;
	send_net[18] = temp & 0x00ff;

    /*冷冻显示温度（0.1精度）*/
	temp = (short)((r_ldxswd - 200) * 10);
    if(temp < 0)
        temp = 0x8000 | abs(temp);
	send_net[19] = temp >> 8;
	send_net[20] = temp & 0x00ff;

	r_lcxswd = (unsigned char)floor(r_lcxswd_float);
	send_net[21] = r_lcxswd; //冷藏显示温度
	send_net[22] = r_ldxswd;
	send_net[23] = r_lczt; //冷藏档位
	send_net[24] = r_ldzt; //冷冻档位

	send_net[25] = r_lczt + r_lc_high_alarm; //冷藏室报警上限
	send_net[26] = r_lczt - r_lc_low_alarm;  //冷藏室报警下限
	send_net[27] = r_ldzt + r_ld_high_alarm; //冷冻报警上限
	send_net[28] = r_ldzt - r_ld_low_alarm;  //冷冻报警下限

	send_net[29] = u8_year;
	send_net[30] = u8_month;
	send_net[31] = u8_day;
	send_net[32] = u8_hour;
	send_net[33] = u8_minute;
	send_net[34] = 0x00;

	send_net[35] = r_hwsjwd; //环温

	send_net[36] = 10;
	send_net[37] = 10;

	send_net[38] = flag_err2;
	send_net[39] = flag_err1;

	send_net[40] = 0x00;
	send_net[41] = 0x00;
	if (f_door_switch)
		send_net[41] = send_net[41] | 0x40;
	send_net[42] = 0x00;
	send_net[43] = 0x00;

	GetSum();
}
/****************设置时间命令帧******************/
/************************************************/
void SetTimeFrame(void)
{
	uchar i;
	// if (!f_net_first_set_time)   //还没接收到USB模块的时间
	// {
	// 	f_Set_Time = 0;
	// 	return;
	// }

	if (f_Set_Time)
	{
		if (f_send_1ff || f_send_2ff || f_send_data)
		{
			return;
		}

		{
			for (i = 0; i <= 49; i++)
			{
				send_net[i] = 0x00;
			}

			r_sendsum = 0x10;
			send_net[1] = (uchar)(u16_random_time & 0x00ff);
			send_net[0] = (uchar)((u16_random_time >> 8) & 0x00ff);
			send_net[2] = rec_net[2];
			send_net[3] = rec_net[3];
			send_net[4] = rec_net[4];
			send_net[5] = rec_net[5];

			send_net[6] = 0x01;
			send_net[7] = 0x5D;
			send_net[8] = 0x09;

			send_net[9] = u8_year_set;
			send_net[10] = u8_month_set;
			send_net[11] = u8_day_set;
			send_net[12] = u8_hour_set;
			send_net[13] = u8_minute_set;
			send_net[14] = 0x00;
			GetSum();
			f_Set_Time = 0;
		}
	}
}
/************************************************/
/***************U-Home回报帧*****************/
/************************************************/
void NetResponseStateControl(void)
{
	if (F_StopResponse && F_FirstPowerRespinseDone)
	{
		R_HomeNetResponseTimeSecond = 0;
		R_HomeNetResponseCheckTime100ms = 0;
		F_ResponseFirstFrame = 0;
	}
	else
	{
		if (!F_FirstPowerResponse)
		{
			F_FirstPowerResponse = 1;
			u16_random_copyTemp = u16_random;
			u16_random_copy = u16_random_copyTemp;
			R_HomeNetResponseCheckTime100ms = 0;
			F_ResponseFirstFrame = 1;
			ResponseFirstPowerState();
		}
		else if (R_HomeNetResponseCheckTime100ms >= R_HomeNetResponseCheckTime)
		{
			if ((r_voltageCopy != r_voltage) ||
				(r_lcztCopy != r_lczt) ||
				(r_ldztCopy != r_ldzt) ||
				(r_lc_high_alarmCopy != r_lc_high_alarm) ||
				(r_lc_low_alarmCopy != r_lc_low_alarm) ||
				(r_ld_high_alarmCopy != r_ld_high_alarm) ||
				(r_ld_low_alarmCopy != r_ld_low_alarm))
			{
				r_voltageCopy = r_voltage;
				r_lcztCopy = r_lczt;
				r_ldztCopy = r_ldzt;
				r_lc_high_alarmCopy = r_lc_high_alarm;
				r_lc_low_alarmCopy = r_lc_low_alarm;
				r_ld_high_alarmCopy = r_ld_high_alarm;
				r_ld_low_alarmCopy = r_ld_low_alarm;
				F_NeedResponse = 1;
				F_ReceiveResponseAck = 0;
				u16_random_copyTemp = u16_random;
			}
			if ((!F_ReceiveResponseAck) && (F_NeedResponse))
			{
				if (!F_ResponseFirstFrame)
				{
					R_HomeNetCounter = 0;
					F_ResponseFirstFrame = 1;
					R_HomeNetResponseTimeSecond = 0;
					u16_random_copy = u16_random_copyTemp;
					ReturnReportFrame();
				}
			}
			R_HomeNetResponseCheckTime100ms = 0;
		}
		else
		{
			if ((!F_ReceiveResponseAck) && F_ResponseFirstFrame)
			{
				if (R_HomeNetCounter < 2)
				{
					if (R_HomeNetResponseTimeSecond >= 200) //zyj  100416 100506
					{
						R_HomeNetResponseTimeSecond = 0;
						//u16_random_copy = u16_random_copyTemp;
						if (!F_FirstPowerRespinseDone)
						{
							ResponseFirstPowerState();
						}
						else
						{
							ReturnReportFrame();
						}
						R_HomeNetCounter++;
					}
				}
				else
				{
					F_FirstPowerRespinseDone = 1;
					F_ResponseFirstFrame = 0;
					F_NeedResponse = 0;
				}
			}
		}
	}
}
/*******************汇报帧程序*******************/
/************************************************/
void ReturnReportFrame(void)
{
	if (f_send_1ff || f_send_2ff || f_send_data)
	{
		return;
	}
	r_sendsum = 0x2d; //45
					  // u16_random_copy = u16_random;
	send_net[1] = (uchar)(u16_random_copy & 0x00ff);
	send_net[0] = (uchar)((u16_random_copy >> 8) & 0x3F); //0b00111111);  @20181130 CFJ
	send_net[2] = 0x00;
	send_net[3] = 0x00;
	send_net[4] = 0x00;
	send_net[5] = 0x00;

	send_net[6] = 0x06;

	send_net[7] = 0x6d;
	send_net[8] = 0x01;

	send_net[9] = 0x00;
	send_net[10] = 0x00;

	send_net[11] = 0x00;
	send_net[12] = r_voltage; //电压

	send_net[13] = 0x00;
	send_net[14] = 0x00;

