191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
	send_net[15] = 0x00;
	send_net[16] = 0x00;

	send_net[17] = 0x00;
	send_net[18] = 0x00;
	send_net[19] = 0x00;
	send_net[20] = 0x00;

	send_net[21] = r_lcxswd; //冷藏显示温度
	send_net[22] = r_ldxswd;
	send_net[23] = r_lczt; //冷藏档位
	send_net[24] = r_ldzt; //冷冻档位

	send_net[25] = r_lczt + r_lc_high_alarm; //冷藏室报警上限
	send_net[26] = r_lczt - r_lc_low_alarm;  //冷藏室报警下限
	send_net[27] = r_ldzt + r_ld_high_alarm; //冷冻报警上限
	send_net[28] = r_ldzt - r_ld_low_alarm;  //冷冻报警下限

	send_net[29] = u8_year;
	send_net[30] = u8_month;
	send_net[31] = u8_day;
	send_net[32] = u8_hour;
	send_net[33] = u8_minute;
	send_net[34] = 0x00;

	send_net[35] = r_hwsjwd; //环温

	send_net[36] = 10;
	send_net[37] = 10;

	send_net[38] = flag_err2;
	send_net[39] = flag_err1;

	send_net[40] = 0x00;
	send_net[41] = 0x00;
	if (f_door_switch)
		send_net[41] = send_net[41] | 0x40;
	send_net[42] = 0x00;
	send_net[43] = 0x00;
	GetSum();
}
/************************************************/
/************************************************/
/*******     初次上电汇报状态     ***************/
/************************************************/
void ResponseFirstPowerState(void)
{
	if (f_send_1ff || f_send_2ff || f_send_data)
	{
		return;
	}
	r_sendsum = 0x08;
	send_net[0] = (((uchar)(u16_random_copy >> 8)) & 0x3F); //@20181130 CFJ //0b00111111); //zyj  100504
	send_net[1] = (((uchar)(u16_random_copy)) & 0xFF);		//@20181130 CFJ //0b11111111);  //zyj  100504
	send_net[2] = rec_net[2];
	send_net[3] = rec_net[3];
	send_net[4] = rec_net[4];
	send_net[5] = rec_net[5];
	send_net[6] = 0x72;
	GetSum();
}

/*******************故障报警程序*********************/
/****************************************************/
void NetErrAlarm(void)
{
	if (flag_err1 == 0 && flag_err2 == 0)
	{
		flag_err1_copy = flag_err1;
		flag_err2_copy = flag_err2;
		f_stop_net_alarm = 0;
		f_ack = 0;
	}
	else
	{
		if (flag_err1 != flag_err1_copy || flag_err2 != flag_err2_copy)
		{
			flag_err1_copy = flag_err1;
			flag_err2_copy = flag_err2;
			t_err200ms = t_onems;
			t_ack5s = t_halfsec;
			f_stop_net_alarm = 0;
			f_ack = 0;
			u16_random_errcopy = u16_random;
		}
		else if (f_stop_net_alarm)
		{
			return;
		}
		else if (f_ack)
		{
			if ((t_halfsec - t_ack5s) >= 10)
			{
				f_ack = 0;
			}
		}
		else if ((uchar)(t_onems - t_err200ms) >= 200)
		{
			t_err200ms = t_onems;
			t_ack5s = t_halfsec;
			r_sendsum = 0x0e; //14
							  // u16_random_errcopy = u16_random;
			send_net[1] = (uchar)(u16_random_errcopy & 0x00ff);
			send_net[0] = (uchar)((u16_random_errcopy >> 8) & 0x00ff);

			send_net[2] = 0;
			send_net[3] = 0;
			send_net[4] = 0;
			send_net[5] = 0;

			send_net[6] = 0x04;

			send_net[7] = 0x0f;
			send_net[8] = 0x5a;

			send_net[9] = 0;
			send_net[10] = 0;

			send_net[11] = flag_err2;
			send_net[12] = flag_err1;
			GetSum();
		}
	}
}
/************************************************/
/*******************返回无效值程序***************/
/************************************************/
void ReturnVoidFrame(void)
{
	r_sendsum = 0x0c;
	send_net[0] = rec_net[0];
	send_net[1] = rec_net[1];
	send_net[2] = rec_net[2];
	send_net[3] = rec_net[3];
	send_net[4] = rec_net[4];
	send_net[5] = rec_net[5];
	send_net[6] = 0x03;
	send_net[7] = 0x00;
	send_net[8] = 0x00;
	send_net[9] = 0x00;
	send_net[10] = R_VoidFrameCode;
	GetSum();
}
/*******************返回ACK程序******************/
/************************************************/
void ReturnAckFrame(void)
{
	r_sendsum = 0x08;
	send_net[0] = rec_net[0];
	send_net[1] = rec_net[1];
	send_net[2] = rec_net[2];
	send_net[3] = rec_net[3];
	send_net[4] = rec_net[4];
	send_net[5] = rec_net[5];
	send_net[6] = 0x05;
	GetSum();
}
/******************返回识别码查询帧程序***********/
/************************************************/
void ReturnIdentifycodeFrame(void)
{
	r_sendsum = 0x18;
	send_net[0] = rec_net[0];
	send_net[1] = rec_net[1];
	send_net[2] = rec_net[2];
	send_net[3] = rec_net[3];
	send_net[4] = rec_net[4];
	send_net[5] = rec_net[5];
	send_net[6] = 0x71;

	send_net[7] = 0x01;
	send_net[8] = 0xc1;
	send_net[9] = 0x20;
	send_net[10] = 0x02;
	send_net[11] = 0x40;
	send_net[12] = 0x00;
	send_net[13] = 0x81;
	send_net[14] = 0xc0;
	send_net[15] = 0x40;
	send_net[16] = 0x81;
	send_net[17] = 0x03;
	send_net[18] = 0x35;
	send_net[19] = 0x6c;
	send_net[20] = 0x90;
	send_net[21] = 0x00;
	send_net[22] = 0x00;
	GetSum();
}
/************************************************/
/*******************计算校验和程序***************/
/************************************************/
void GetSum(void)
{
	uchar r_checksum = 0;
	for (r_sendr = 0; r_sendr < (unsigned char)(r_sendsum - 1); r_sendr++)
	{
		if (send_net[r_sendr] == 0xff)
		{
			r_checksum = r_checksum + 0x55;
		}
		r_checksum = r_checksum + send_net[r_sendr];
	}
	r_checksum = r_checksum + r_sendsum;
	send_net[r_sendr] = r_checksum;
	Mfs_Uart_EnableIrq(&UART2, UartTxIrq); //使能发送中断//////SCI1C2_TCIE = 1;                                 //使能发送模块
}
/************************************************/
/*******************接收初始化程序***************/
/************************************************/
void ReceiveInitial(void)
{
	if (f_rec_1ff || f_rec_2ff || f_rec_data)
	{
		if ((uchar)(t_onems - t_net_rec) >= 200) //200ms
		{
			f_rec_over = 0;
			f_rec_1ff = 0;
			f_rec_2ff = 0;
			f_rec_data = 0;
			f_rec55 = 0;
			r_rec55sum = 0;
		}
	}
}

/************************************************/
void Pannel_Comm_Deal(void) //@CFJ 面板通讯处理
{
	if (g_Pannel_Comm_bRcv_Done)
	{
		g_Pannel_Comm_bRcv_Done = 0;
		//g_Bus_Rec_Time=0;//正确接受完数据，则2s时间清0；
		//g_Txd_Time = 250 ;                   //500ms计时开始 发送
		g_UART1_RCV_Cyc = 0;
		g_UART1_RCV_Counter = 0;

		g_Bus_Error_Time = 0; //1min时间
		g_Sys_Erflag0_Comm = 0;

		//g_Sys_Stateflag10_bFirst_Rcv_ODM = TURE ;
		//g_RX_LED_Time = 5 ;                       //接收校验和正确 接收灯亮50ms

		///if(!g_Sys_Setflag4_bID_Only)
		//{
		l_ODM_Data_Parse();
		//}
		//bUartSendStartFlag = 1 ;//g_IDM_ODM_Comm_bPrase_Done = TURE ;
	}
}
//-----------------------------------------------------------------//
void l_ODM_Data_Parse(void) //接受主板解析数据 CFJ
{
	unsigned char Lc_Temp, Lc_Temp_2, VoltageTemp;
	unsigned char batteryTemp;
	if (g_Sys_ReceiveDataType) //接受数据帧类型  CFJ
	{
		//电压
		VoltageTemp = Pannel_Uart1Data[22] << 4;
		VoltageTemp |= Pannel_Uart1Data[23] >> 4;
		r_voltage_ad = VoltageTemp;
		if(r_voltage_ad <= 30)
			r_voltage = 0;
		else if(r_voltage_ad <= 215)
			r_voltage = tab_voltage[r_voltage_ad-13]; 
		else
			r_voltage = 255;

		//电池
		batteryTemp = (Pannel_Uart1Data[20] << 4);
		batteryTemp |= (Pannel_Uart1Data[21] >> 4);
		r_battery_ad = batteryTemp;
		//flag_rec1 = Pannel_Uart1Data[6];//无效
		if (!f_first_ad)
		{
			r_voltage_report = r_voltage; //r_voltage_report变量无效
		}
		if (Pannel_Uart1Data[24] & 0x07) //@20181130 CFJ 电池插反 短接 低压故障
		{
			f_battery = 1; //电池故障标志
		}
		else
		{
			f_battery = 0;
		}
		f_Self_first_ad = 1;
	}
	else
	{
		//冷冻的温度处理
		r16_ldad = Pannel_Uart1Data[13]; //高位//rec[3];
		r16_ldad = r16_ldad << 8;		 //r16_ldad<<8;
		r16_ldad = (r16_ldad & 0xff00) | Pannel_Uart1Data[14];
		r16_ldad >>= 2; //12位AD转换为10位AD
		if ((r16_ldad <= 1010) && (r16_ldad >= 15))
		{
			//这个括号内程序没有全部对区间处理,但不影响程序正确性
			if (SelfCheckFlag == 0)
			{
				if ((r_ldwdjz >= 10) && (r16_ldad > 35)) //温度校正是正数&&温度小于等于50
				{
					r16_ldad = r16_ldad - (r_ldwdjz - 10) * 4; //校准上偏10.温度对应4个AD
				}
				else if ((r_ldwdjz < 10) && (r16_ldad < 990))
				{
					r16_ldad = r16_ldad + (10 - r_ldwdjz) * 4;
				}
			}
		}

		if (r16_ldad > 470)
		{
			r_ldsjwd = 140; //-60度
		}
		else if (r16_ldad < 36)
		{
			r_ldsjwd = 250; //50度
		}
		else
		{
			r_ldsjwd = (tab_temperature[r16_ldad - 36]);
		}

		//冷藏温度的处理,没有温度显示在50~-60度的限制
		Lc_Temp = Pannel_Uart1Data[5] << 4;
		Lc_Temp |= Pannel_Uart1Data[6] >> 4;

		Lc_Temp_2 = Pannel_Uart1Data[7] << 4;
		Lc_Temp_2 |= Pannel_Uart1Data[8] >> 4; // 20190410  HYC-386项目修改为NTC2作为冷藏传感器HW

		r_lcad_8b = Lc_Temp;
		r_lcad_12b = Pannel_Uart1Data[5] * 256 + Pannel_Uart1Data[6];

        /*8位ad偏移处理*/
		if ((r_lcad_8b < 250) && (r_lcad_8b > 5))
		{
			if (SelfCheckFlag == 0)
			{
				if ((r_lcwdjz >= 100) && (r_lcad_8b > 20)) //温度校正
				{
					r_lcad_8b = r_lcad_8b - ((r_lcwdjz - 100) / 10.0) * 3;
				}
				else if ((r_lcwdjz < 10) && (r_lcad_8b < 235))
				{
					r_lcad_8b = r_lcad_8b + ((100 - r_lcwdjz) / 10.0) * 3;
				}
			}
		}

		r_lcwd = CheckLcTable(r_lcad_8b);   //整数温度现在只用于测试模式
		r_lcwd_float = (float)CheckLcTable_12b(r_lcad_12b) + (r_lcwdjz - 100) / 10.0;
        if(r_lcwd_float < 8.0)
            r_lcwd_float = 8.0;
        if(r_lcwd_float > 98.0)
            r_lcwd_float = 98.0;
	}
	f_first_ad = 1;
}

void l_Pannel_DataTx(void)
{
	if (bUartSendStartFlag) //&& (g_Txd_Time <= 0))
	{
		bUartSendStartFlag = 0;
		l_Send_Data_Build();
	}
}

void l_Send_Data_Build(void)
{
	unsigned char NDegree, Sum, Temp;
	l_ClrIDMSendBuf();
	Sum = 0;
	g_IDM_TX_ODM_Data[0] = 0xAA;

	g_IDM_TX_ODM_Data[1] = 0x55; //  头码4个字节

