191919-hub/yuchen/mb9bf524L_template/template/IAR/source/logicsub.c
	g_IDM_TX_ODM_Data[26] = 0xFF; //压缩机2

	/*
    if(!g_Sys_Erflag0_Comm)  //无故障，则上电默认开机
    {
        g_IDM_TX_ODM_Data[2] |=0x80;
    }
    if(f_lc_compressor)  //冷藏压机
    {
        g_IDM_TX_ODM_Data[2] |=0x40;
    } 
    if(f_compressor)  //冷冻压机
    {
        g_IDM_TX_ODM_Data[2] |=0x20;
    
    }
    if(f_lc_fan)  //冷藏风机
    {
        g_IDM_TX_ODM_Data[2] |=0x10;    
    }
    
    if(f_ln_fan)  //冷冻风机
    {
        g_IDM_TX_ODM_Data[2] |=0x08;    
    }
    
    if(f_defrost)  //除霜
    {
        g_IDM_TX_ODM_Data[2] |=0x04;    
    }
    
    if(f_nd_fan)  //内风机
    {
        g_IDM_TX_ODM_Data[2] |=0x02;    
    }
    
    if(g_Compressor_Frequency_Flag1)  //压机1变频/定频选择标志
    {
        g_IDM_TX_ODM_Data[3] |=0x80;  //变频
    }
    else
    {   
         g_IDM_TX_ODM_Data[3]=0xFF;
    }
    if(g_Compressor_Frequency_Flag2)  //压机2变频/定频选择标志
    {
        g_IDM_TX_ODM_Data[4] |=0x80;  //变频    
    }
    else
    {
        g_IDM_TX_ODM_Data[4]=0xFF;
    }
    
    if(f_long_range_alarm)  //远程报警
    {
        g_IDM_TX_ODM_Data[5]|=0x80;
    }
    //后备输出 默认有
     g_IDM_TX_ODM_Data[5]|=0x40;
    
    if(f_buzz_alarm)
    {
        g_IDM_TX_ODM_Data[5]|=0x20;
    }
    
    //12v 负载 4路都输出  D4 D3 D2 D1
    
    g_IDM_TX_ODM_Data[5]|=0x00;
    
    //预留
  
    g_IDM_TX_ODM_Data[6] = 0x00;
    g_IDM_TX_ODM_Data[7] = 0x00;
    
    //校验和字节
    g_IDM_TX_ODM_Data[8]=0;  
    */
	for (NDegree = 4; NDegree <= 28; NDegree++)
	{
		Sum += g_IDM_TX_ODM_Data[NDegree];
	}
	g_IDM_TX_ODM_Data[29] = Sum;
	g_UART1_TXD_Counter = 0;
	RS_485_STATUS = 1; //发送有效
	g_Rec_Status_Flag = 0;
	Mfs_Uart_EnableIrq(&UART1, UartTxIdleIrq); //UartTxIrq); //使能发送中断
}

void l_Pannel_Self_DataTx(void)
{
	if (bSelfUartSendStartFlag) //@20190215 CFJ
	{
		bSelfUartSendStartFlag = 0;
		l_Self_Send_Data_Build();
	}
}